report/sysbench/SSP_test/oltp_delete.master_ssm_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 47353.08 qps: 47353.08 (r/w/o: 0.00/47215.59/137.50) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 47915.56 qps: 47915.56 (r/w/o: 0.00/47501.76/413.80) lat (ms,99%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 49347.66 qps: 49347.66 (r/w/o: 0.00/48635.25/712.41) lat (ms,99%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 48621.52 qps: 48621.52 (r/w/o: 0.00/47599.52/1022.00) lat (ms,99%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 47127.93 qps: 47127.93 (r/w/o: 0.00/45884.33/1243.60) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 48322.69 qps: 48322.69 (r/w/o: 0.00/46736.29/1586.40) lat (ms,99%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 47712.10 qps: 47712.10 (r/w/o: 0.00/45881.51/1830.59) lat (ms,99%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 47926.12 qps: 47926.12 (r/w/o: 0.00/45802.32/2123.81) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 47934.92 qps: 47934.92 (r/w/o: 0.00/45543.10/2391.82) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 47441.54 qps: 47441.54 (r/w/o: 0.00/44783.73/2657.81) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 48585.86 qps: 48585.86 (r/w/o: 0.00/45610.47/2975.39) lat (ms,99%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 49815.19 qps: 49815.19 (r/w/o: 0.00/46458.41/3356.79) lat (ms,99%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 47555.80 qps: 47555.80 (r/w/o: 0.00/44095.78/3460.01) lat (ms,99%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 48600.08 qps: 48600.08 (r/w/o: 0.00/44819.29/3780.79) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 47924.86 qps: 47924.86 (r/w/o: 0.00/43917.50/4007.35) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 48993.02 qps: 48993.02 (r/w/o: 0.00/44613.00/4380.02) lat (ms,99%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 47900.66 qps: 47900.66 (r/w/o: 0.00/43349.42/4551.24) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 50133.98 qps: 50133.98 (r/w/o: 0.00/45094.67/5039.32) lat (ms,99%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 49541.65 qps: 49541.65 (r/w/o: 0.00/44281.21/5260.45) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 50505.94 qps: 50505.94 (r/w/o: 0.00/44915.14/5590.79) lat (ms,99%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 49588.12 qps: 49588.12 (r/w/o: 0.00/43828.73/5759.39) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 51184.02 qps: 51184.02 (r/w/o: 0.00/44944.02/6240.00) lat (ms,99%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 48705.47 qps: 48705.47 (r/w/o: 0.00/42484.46/6221.01) lat (ms,99%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 50866.93 qps: 50866.93 (r/w/o: 0.00/44152.20/6714.73) lat (ms,99%): 14.21 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           5441167
        other:                           407308
        total:                           5848475
    transactions:                        5848475 (48721.53 per sec.)
    queries:                             5848475 (48721.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0374s
    total number of events:              5848475

Latency (ms):
         min:                                    0.29
         avg:                                    4.10
         max:                                  224.08
         99th percentile:                       14.73
         sum:                             23999708.33

Threads fairness:
    events (avg/stddev):           29242.3750/80.49
    execution time (avg/stddev):   119.9985/0.01