report/sysbench/SSP_test/oltp_delete.master_ssp_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 155837.55 qps: 155837.55 (r/w/o: 0.00/154324.44/1513.10) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 137147.85 qps: 137147.85 (r/w/o: 0.00/133336.23/3811.63) lat (ms,99%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 144476.07 qps: 144476.07 (r/w/o: 0.00/138043.40/6432.67) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 160681.99 qps: 160681.99 (r/w/o: 0.00/150567.08/10114.91) lat (ms,99%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 133965.85 qps: 133965.85 (r/w/o: 0.00/123352.46/10613.39) lat (ms,99%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 168510.45 qps: 168510.45 (r/w/o: 0.00/152075.23/16435.22) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 141109.37 qps: 141109.37 (r/w/o: 0.00/125021.72/16087.65) lat (ms,99%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 123748.91 qps: 123748.91 (r/w/o: 0.00/107828.13/15920.78) lat (ms,99%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 165190.81 qps: 165190.81 (r/w/o: 0.00/141390.01/23800.80) lat (ms,99%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 168692.03 qps: 168692.03 (r/w/o: 0.00/141282.59/27409.44) lat (ms,99%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 124877.27 qps: 124877.27 (r/w/o: 0.00/102841.25/22036.02) lat (ms,99%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 164898.03 qps: 164898.03 (r/w/o: 0.00/133169.52/31728.51) lat (ms,99%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 122963.86 qps: 122963.86 (r/w/o: 0.00/97542.04/25421.82) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 179107.25 qps: 179107.25 (r/w/o: 0.00/139644.12/39463.13) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 153871.98 qps: 153871.98 (r/w/o: 0.00/117493.25/36378.74) lat (ms,99%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 174949.73 qps: 174949.73 (r/w/o: 0.00/130655.29/44294.43) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 166188.71 qps: 166188.71 (r/w/o: 0.00/121511.50/44677.21) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 173853.14 qps: 173853.14 (r/w/o: 0.00/124462.64/49390.50) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 163081.75 qps: 163081.75 (r/w/o: 0.00/114375.13/48706.62) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 136266.35 qps: 136266.35 (r/w/o: 0.00/93805.14/42461.21) lat (ms,99%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 174755.47 qps: 174755.47 (r/w/o: 0.00/118057.99/56697.48) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 159353.31 qps: 159353.31 (r/w/o: 0.00/105229.83/54123.48) lat (ms,99%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 166580.19 qps: 166580.19 (r/w/o: 0.00/107877.64/58702.55) lat (ms,99%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 146229.81 qps: 146229.81 (r/w/o: 0.00/92651.56/53578.25) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           14833382
        other:                           3699082
        total:                           18532464
    transactions:                        18532464 (154392.07 per sec.)
    queries:                             18532464 (154392.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0337s
    total number of events:              18532464

Latency (ms):
         min:                                    0.26
         avg:                                    1.29
         max:                                  987.78
         99th percentile:                       11.24
         sum:                             23992998.93

Threads fairness:
    events (avg/stddev):           92662.3200/515.95
    execution time (avg/stddev):   119.9650/0.01