report/sysbench/SSP_test/oltp_point_select.master_ssm_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 102178.39 qps: 102178.39 (r/w/o: 102178.39/0.00/0.00) lat (ms,99%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 197208.13 qps: 197208.13 (r/w/o: 197208.13/0.00/0.00) lat (ms,99%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 192104.88 qps: 192104.88 (r/w/o: 192104.88/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 192209.58 qps: 192209.58 (r/w/o: 192209.58/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 190446.01 qps: 190446.01 (r/w/o: 190446.01/0.00/0.00) lat (ms,99%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 192041.87 qps: 192041.87 (r/w/o: 192041.87/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 193492.34 qps: 193492.34 (r/w/o: 193492.34/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 194357.83 qps: 194357.83 (r/w/o: 194357.83/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 185824.75 qps: 185824.75 (r/w/o: 185824.75/0.00/0.00) lat (ms,99%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 186772.29 qps: 186772.29 (r/w/o: 186772.29/0.00/0.00) lat (ms,99%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 186361.13 qps: 186361.13 (r/w/o: 186361.13/0.00/0.00) lat (ms,99%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 184943.14 qps: 184943.14 (r/w/o: 184943.14/0.00/0.00) lat (ms,99%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 186781.04 qps: 186781.04 (r/w/o: 186781.04/0.00/0.00) lat (ms,99%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 186783.71 qps: 186783.71 (r/w/o: 186783.71/0.00/0.00) lat (ms,99%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 185211.37 qps: 185211.37 (r/w/o: 185211.37/0.00/0.00) lat (ms,99%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 186274.21 qps: 186274.21 (r/w/o: 186274.21/0.00/0.00) lat (ms,99%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 187556.23 qps: 187556.03 (r/w/o: 187556.03/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 192103.66 qps: 192103.66 (r/w/o: 192103.66/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 184212.35 qps: 184212.55 (r/w/o: 184212.55/0.00/0.00) lat (ms,99%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 185027.62 qps: 185027.62 (r/w/o: 185027.62/0.00/0.00) lat (ms,99%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 184131.08 qps: 184131.08 (r/w/o: 184131.08/0.00/0.00) lat (ms,99%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 185578.30 qps: 185578.30 (r/w/o: 185578.30/0.00/0.00) lat (ms,99%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 184866.01 qps: 184866.01 (r/w/o: 184866.01/0.00/0.00) lat (ms,99%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 185544.17 qps: 185544.17 (r/w/o: 185544.17/0.00/0.00) lat (ms,99%): 2.22 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            22160773
        write:                           0
        other:                           0
        total:                           22160773
    transactions:                        22160773 (184624.63 per sec.)
    queries:                             22160773 (184624.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0301s
    total number of events:              22160773

Latency (ms):
         min:                                    0.31
         avg:                                    1.08
         max:                                  247.63
         99th percentile:                        2.43
         sum:                             23990003.82

Threads fairness:
    events (avg/stddev):           110803.8650/845.43
    execution time (avg/stddev):   119.9500/0.01